#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_cloudfunctions_function.scrapper: Reading...
data.google_cloudfunctions_function.scrapper: Read complete after 1s [id=projects/madproject-201813/locations/europe-west2/functions/accommodation-scrapper]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_scheduler_job.timer will be created
  + resource "google_cloud_scheduler_job" "timer" {
      + attempt_deadline = "30s"
      + description      = "Triggers accommodation scrapper once an hour"
      + id               = (known after apply)
      + name             = "accommodation-invoker"
      + paused           = (known after apply)
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "0 * * * *"
      + state            = (known after apply)
      + time_zone        = "Etc/UTC"

      + http_target {
          + http_method = "GET"
          + uri         = "https://europe-west2-madproject-201813.cloudfunctions.net/accommodation-scrapper"

          + oidc_token {
              + service_account_email = (known after apply)
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 3
        }
    }

  # google_project_iam_binding.function_invoker_role will be created
  + resource "google_project_iam_binding" "function_invoker_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "madproject-201813"
      + role    = "roles/cloudfunctions.invoker"
    }

  # google_service_account.function_invoker will be created
  + resource "google_service_account" "function_invoker" {
      + account_id   = "function-invoker"
      + description  = "Service account to invoke functions"
      + disabled     = false
      + display_name = "Function Invoker"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @y-popov, Action: `pull_request`*